; domain
(define (domain default)
  (:requirements :strips :typing :conditional-effects)  ; Specifies the requirements: STRIPS, ADL, and typing.
  (:types
    agent workstation warehouse box supply - locatable  ; Object supply_types.
    location supply_type carrier - object
    capacity - object
  )
  (:predicates
    (adjacent ?l1 ?l2 - location)       ; Indicates that ?l1 is adjacent to ?l2.
    (at ?o - locatable ?l - location)  ; Indicates that object ?o is at location ?l.
    (empty ?b - box)   ; Indicates that ?b, a box, is empty.
    (box_carried_by ?b - box ?a - agent) ; Indicates that ?b, a box, is being carried by ?a, an agent.
    (contains ?b - box ?s - supply) ; Indicates that ?b, a box, contains ?s, a supply.
    (is ?s - supply ?t - supply_type) ; Indicates the supply_type ?t of a supply ?s.
    (has ?ws - workstation ?t - supply_type) ; Indicates that workstation ?ws requires a supply of supply_type ?t.
    (loaded_to ?s - supply ?ws - workstation) ; Indicates that supply ?s has been loaded to workstation ?ws.
    (unloaded_box ?b - box ?ws - workstation)
    
    
    (attached ?c - carrier ?a - agent) ; A carrier is attached to an agent.
    (on ?c - carrier ?b - box) ; A box is on a carrier.
      ;; capacity
    (carrier_capacity ?c - carrier ?cap - capacity)
    (predecessor ?cap0 - capacity ?cap1 - capacity)
  )
  
  ;; Actions
  (:action move
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
      (adjacent ?from ?to)  ; Requires ?from to be adjacent to ?to.
      (at ?a ?from)  ; Agent ?a must be at the ?from location.
    )
    :effect (and 
      (at ?a ?to)  ; Agent ?a is now at ?to location.
      (not (at ?a ?from))  ; Agent ?a is no longer at ?from location.
    )
  )
  
  (:action take_box
    :parameters (?a - agent ?b - box ?c - carrier ?l - location ?c0 ?c1 - capacity)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?b ?l)  ; Box ?b must be at ?l location.

      (attached ?c ?a)  ; The carrier must be attached to the agent.
      (predecessor ?c0 ?c1)
      (carrier_capacity ?c ?c1)
    )
    :effect (and 
      (not (at ?b ?l))  ; Box ?b is no longer at ?l location.
      (box_carried_by ?b ?a)  ; Box ?b is now carried by agent ?a.

      (carrier_capacity ?c ?c0)
      (not (carrier_capacity ?c ?c1))  
      (on ?c ?b)
    )
  )
  
  (:action fill_box
    :parameters (?a - agent ?b - box ?s - supply ?l - location)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?s ?l)  ; Supply ?s must be at ?l location.
      (empty ?b)  ; Box ?b must be empty.
      (box_carried_by ?b ?a)
    )
    :effect (and 
      (not (empty ?b))  ; Box ?b is no longer empty.
      (contains ?b ?s)  ; Box ?b now contains supply ?s.
      (not (at ?s ?l))  ; Supply ?s is no longer at ?l location.
    )
  )

  (:action deliver_box
    :parameters (?a - agent ?b - box ?c - carrier ?ws - workstation ?l - location ?c0 ?c1 - capacity)
    :precondition (and 
      (box_carried_by ?b ?a)  ; Box ?b must be carried by agent ?a.
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?ws ?l)

      (attached ?c ?a)  ; The carrier must be attached to the agent.
      (on ?c ?b)  ; The box must be on the carrier.
      (predecessor ?c0 ?c1)
      (carrier_capacity ?c ?c0)
    )
    :effect (and 
      (not (box_carried_by ?b ?a))  ; Box ?b is no longer carried by agent ?a.
      (unloaded_box ?b ?ws)

      (not (on ?c ?b))
      (carrier_capacity ?c ?c1)
      (not (carrier_capacity ?c ?c0))    
    )
  )
    
  (:action deliver_supply
    :parameters (?a - agent ?ws - workstation ?t - supply_type ?s - supply ?b - box ?l - location )
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?ws ?l)  ; Workstation ?ws must be at ?l location.
      (is ?s ?t)  ; Supply ?s must be of supply_type ?t.
      (unloaded_box ?b ?ws)
      (contains ?b ?s)  ; Box ?b must contain supply ?s.
    )
    :effect (and 
      (loaded_to ?s ?ws)  ; Supply ?s is now loaded to workstation ?ws.
      (not (contains ?b ?s))  ; Box ?b no longer contains supply ?s.
      (not (unloaded_box ?b ?ws))
      (empty ?b)  ; Box ?b is now empty.
      (at ?b ?l)
      (has ?ws ?t)  ; Workstation ?ws now has a supply of supply_type ?t.
    )
  )
)

; problem
;; problem file: problem_5.pddl
(define (problem default)
  (:domain default)
  (:objects l4_4 l4_6 l5_1 l6_1 l6_0 l6_2 l6_6 l1_6 l2_1 l3_0 l5_5 l5_3 l6_4 l1_4 l3_6 l1_5 l5_0 l2_6 l0_5 l4_2 l4_1 l0_6 l2_2 l5_2 l2_0 l5_6 l2_4 l2_5 l3_2 l4_5 l2_3 l3_3 l5_4 l3_5 l6_5 l6_3 l3_1 l0_4 l4_3 l3_4 - location agent_3 agent_1 agent_2 agent_0 - agent supply_7 supply_4 supply_2 supply_3 supply_5 supply_8 supply_11 supply_9 supply_0 supply_1 supply_10 supply_6 - supply box_1 box_2 box_4 box_9 box_12 box_7 box_5 box_10 box_6 box_3 box_13 box_11 box_14 box_15 box_8 box_0 - box workstation_0 workstation_2 workstation_1 - workstation warehouse_0 - warehouse carrier_0 carrier_3 carrier_2 carrier_1 - carrier tool circuit bolt valve - supply_type capacity_0 capacity_2 capacity_1 capacity_3 capacity_4 - capacity )
  (:init (adjacent l3_2 l3_3) (adjacent l6_6 l6_5) (adjacent l4_5 l4_6) (at agent_3 l3_2) (adjacent l5_2 l5_3) (adjacent l3_4 l4_4) (adjacent l4_2 l4_1) (adjacent l5_1 l5_0) (adjacent l4_4 l4_3) (adjacent l3_3 l3_4) (empty box_3) (at supply_9 l3_2) (predecessor capacity_1 capacity_2) (predecessor capacity_3 capacity_4) (at box_8 l3_2) (adjacent l2_2 l2_3) (adjacent l4_4 l4_5) (adjacent l6_4 l5_4) (adjacent l6_2 l6_1) (at supply_0 l3_2) (is supply_0 valve) (carrier_capacity carrier_0 capacity_4) (predecessor capacity_0 capacity_1) (adjacent l3_3 l3_2) (empty box_7) (empty box_0) (at box_12 l3_2) (adjacent l0_4 l0_5) (adjacent l2_1 l3_1) (adjacent l3_2 l4_2) (empty box_12) (adjacent l1_4 l2_4) (adjacent l4_3 l4_4) (adjacent l6_4 l6_5) (adjacent l5_1 l6_1) (adjacent l2_5 l2_6) (adjacent l4_5 l3_5) (adjacent l1_5 l0_5) (at box_1 l3_2) (at box_0 l3_2) (at supply_5 l3_2) (adjacent l6_5 l5_5) (empty box_13) (adjacent l5_3 l6_3) (adjacent l5_4 l5_5) (at workstation_2 l6_4) (adjacent l3_0 l2_0) (adjacent l4_2 l4_3) (at supply_1 l3_2) (adjacent l4_1 l4_2) (at supply_7 l3_2) (adjacent l4_2 l5_2) (adjacent l1_6 l1_5) (adjacent l6_2 l6_3) (at box_3 l3_2) (at box_6 l3_2) (adjacent l0_5 l0_6) (adjacent l4_1 l5_1) (adjacent l5_3 l5_2) (adjacent l4_4 l5_4) (adjacent l5_2 l5_1) (at supply_6 l3_2) (adjacent l2_4 l2_5) (at supply_10 l3_2) (adjacent l5_5 l5_4) (at box_15 l3_2) (adjacent l3_6 l2_6) (adjacent l4_1 l3_1) (adjacent l0_4 l1_4) (adjacent l5_1 l4_1) (at box_7 l3_2) (at box_13 l3_2) (is supply_10 circuit) (adjacent l2_4 l1_4) (adjacent l2_1 l2_0) (adjacent l5_4 l6_4) (adjacent l6_4 l6_3) (is supply_8 tool) (adjacent l3_0 l3_1) (adjacent l2_6 l1_6) (adjacent l4_3 l5_3) (empty box_14) (empty box_1) (adjacent l5_2 l6_2) (adjacent l2_6 l2_5) (adjacent l6_3 l5_3) (adjacent l0_5 l0_4) (adjacent l3_5 l4_5) (adjacent l3_2 l2_2) (adjacent l3_4 l3_5) (adjacent l3_1 l2_1) (adjacent l4_6 l3_6) (at supply_8 l3_2) (adjacent l2_3 l3_3) (attached carrier_2 agent_2) (adjacent l5_6 l5_5) (adjacent l5_1 l5_2) (adjacent l2_2 l3_2) (adjacent l6_1 l6_2) (at box_11 l3_2) (adjacent l5_4 l4_4) (predecessor capacity_2 capacity_3) (at box_14 l3_2) (adjacent l2_3 l2_2) (attached carrier_0 agent_0) (adjacent l3_3 l4_3) (at box_4 l3_2) (loaded_to supply_1 workstation_1) (at warehouse_0 l3_2) (adjacent l3_1 l3_0) (adjacent l2_4 l2_3) (adjacent l4_5 l5_5) (adjacent l5_6 l4_6) (empty box_11) (empty box_15) (empty box_6) (adjacent l1_4 l1_5) (adjacent l5_5 l5_6) (adjacent l2_6 l3_6) (adjacent l5_5 l4_5) (at supply_3 l3_2) (adjacent l4_3 l4_2) (adjacent l1_6 l0_6) (adjacent l0_5 l1_5) (at workstation_1 l6_0) (is supply_2 valve) (at supply_4 l3_2) (at workstation_0 l4_2) (adjacent l6_1 l6_0) (adjacent l1_5 l1_6) (adjacent l6_2 l5_2) (is supply_7 tool) (adjacent l5_3 l4_3) (is supply_5 bolt) (at supply_11 l3_2) (adjacent l5_2 l4_2) (adjacent l6_0 l6_1) (adjacent l6_3 l6_4) (adjacent l4_6 l4_5) (at box_5 l3_2) (adjacent l3_4 l3_3) (adjacent l4_6 l5_6) (adjacent l3_6 l4_6) (adjacent l3_1 l4_1) (at agent_0 l3_2) (empty box_9) (adjacent l5_6 l6_6) (adjacent l3_3 l2_3) (adjacent l4_5 l4_4) (is supply_6 tool) (adjacent l6_5 l6_6) (carrier_capacity carrier_1 capacity_4) (attached carrier_1 agent_1) (adjacent l6_1 l5_1) (at box_2 l3_2) (adjacent l2_5 l3_5) (adjacent l0_6 l0_5) (adjacent l2_5 l1_5) (adjacent l2_1 l2_2) (empty box_4) (adjacent l3_4 l2_4) (adjacent l5_3 l5_4) (adjacent l1_5 l1_4) (adjacent l0_6 l1_6) (adjacent l2_5 l2_4) (adjacent l4_4 l3_4) (adjacent l2_3 l2_4) (empty box_5) (adjacent l5_4 l5_3) (at box_10 l3_2) (adjacent l2_0 l3_0) (carrier_capacity carrier_2 capacity_4) (adjacent l5_0 l6_0) (adjacent l5_0 l5_1) (at agent_1 l3_2) (adjacent l5_5 l6_5) (empty box_8) (adjacent l6_5 l6_4) (adjacent l3_2 l3_1) (at agent_2 l3_2) (carrier_capacity carrier_3 capacity_4) (is supply_3 bolt) (adjacent l1_6 l2_6) (empty box_2) (adjacent l2_4 l3_4) (attached carrier_3 agent_3) (adjacent l2_2 l2_1) (adjacent l6_6 l5_6) (adjacent l3_5 l2_5) (adjacent l6_0 l5_0) (at supply_2 l3_2) (adjacent l3_5 l3_6) (is supply_9 circuit) (adjacent l3_5 l3_4) (is supply_4 bolt) (adjacent l2_0 l2_1) (adjacent l1_5 l2_5) (adjacent l4_2 l3_2) (adjacent l3_6 l3_5) (adjacent l1_4 l0_4) (is supply_1 valve) (at box_9 l3_2) (is supply_11 circuit) (adjacent l3_1 l3_2) (adjacent l4_3 l3_3) (adjacent l6_3 l6_2) (empty box_10))
  (:goal (and (has workstation_1 bolt) (has workstation_2 tool) (has workstation_0 valve) (has workstation_0 tool) (has workstation_2 bolt) (has workstation_0 circuit) (has workstation_2 valve) (has workstation_1 tool) (has workstation_1 circuit) (has workstation_0 bolt)))
)

; plan
1. (take_box agent_3 box_0 carrier_3 l3_2 capacity_3 capacity_4)
   deleted: (at box_0 l3_2) (carrier_capacity carrier_3 capacity_4)
   added: (box_carried_by box_0 agent_3) (carrier_capacity carrier_3 capacity_3) (on carrier_3 box_0)
   goals met: 0 of 10
2. (move agent_2 l3_2 l4_2)
   deleted: (at agent_2 l3_2)
   added: (at agent_2 l4_2)
   goals met: 0 of 10
3. (move agent_2 l4_2 l5_2)
   deleted: (at agent_2 l4_2)
   added: (at agent_2 l5_2)
   goals met: 0 of 10
4. (move agent_2 l5_2 l6_2)
   deleted: (at agent_2 l5_2)
   added: (at agent_2 l6_2)
   goals met: 0 of 10
5. (move agent_3 l3_2 l4_2)
   deleted: (at agent_3 l3_2)
   added: (at agent_3 l4_2)
   goals met: 0 of 10
6. (take_box agent_1 box_1 carrier_1 l3_2 capacity_3 capacity_4)
   deleted: (at box_1 l3_2) (carrier_capacity carrier_1 capacity_4)
   added: (box_carried_by box_1 agent_1) (carrier_capacity carrier_1 capacity_3) (on carrier_1 box_1)
   goals met: 0 of 10
7. (fill_box agent_1 box_1 supply_3 l3_2)
   deleted: (empty box_1) (at supply_3 l3_2)
   added: (contains box_1 supply_3)
   goals met: 0 of 10
8. (move agent_1 l3_2 l4_2)
   deleted: (at agent_1 l3_2)
   added: (at agent_1 l4_2)
   goals met: 0 of 10
9. (move agent_1 l4_2 l5_2)
   deleted: (at agent_1 l4_2)
   added: (at agent_1 l5_2)
   goals met: 0 of 10
10. (move agent_1 l5_2 l6_2)
   deleted: (at agent_1 l5_2)
   added: (at agent_1 l6_2)
   goals met: 0 of 10
11. (move agent_2 l6_2 l6_1)
   deleted: (at agent_2 l6_2)
   added: (at agent_2 l6_1)
   goals met: 0 of 10
12. (move agent_2 l6_1 l6_0)
   deleted: (at agent_2 l6_1)
   added: (at agent_2 l6_0)
   goals met: 0 of 10
13. (move agent_1 l6_2 l6_3)
   deleted: (at agent_1 l6_2)
   added: (at agent_1 l6_3)
   goals met: 0 of 10
14. (move agent_1 l6_3 l6_4)
   deleted: (at agent_1 l6_3)
   added: (at agent_1 l6_4)
   goals met: 0 of 10
15. (take_box agent_0 box_10 carrier_0 l3_2 capacity_3 capacity_4)
   deleted: (at box_10 l3_2) (carrier_capacity carrier_0 capacity_4)
   added: (box_carried_by box_10 agent_0) (carrier_capacity carrier_0 capacity_3) (on carrier_0 box_10)
   goals met: 0 of 10
16. (fill_box agent_0 box_10 supply_6 l3_2)
   deleted: (empty box_10) (at supply_6 l3_2)
   added: (contains box_10 supply_6)
   goals met: 0 of 10
17. (move agent_0 l3_2 l4_2)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l4_2)
   goals met: 0 of 10
18. (move agent_0 l4_2 l5_2)
   deleted: (at agent_0 l4_2)
   added: (at agent_0 l5_2)
   goals met: 0 of 10
19. (move agent_0 l5_2 l6_2)
   deleted: (at agent_0 l5_2)
   added: (at agent_0 l6_2)
   goals met: 0 of 10
20. (move agent_0 l6_2 l6_1)
   deleted: (at agent_0 l6_2)
   added: (at agent_0 l6_1)
   goals met: 0 of 10
21. (move agent_0 l6_1 l6_0)
   deleted: (at agent_0 l6_1)
   added: (at agent_0 l6_0)
   goals met: 0 of 10
22. (move agent_2 l6_0 l5_0)
   deleted: (at agent_2 l6_0)
   added: (at agent_2 l5_0)
   goals met: 0 of 10
23. (move agent_2 l5_0 l5_1)
   deleted: (at agent_2 l5_0)
   added: (at agent_2 l5_1)
   goals met: 0 of 10
24. (move agent_2 l5_1 l4_1)
   deleted: (at agent_2 l5_1)
   added: (at agent_2 l4_1)
   goals met: 0 of 10
25. (move agent_2 l4_1 l3_1)
   deleted: (at agent_2 l4_1)
   added: (at agent_2 l3_1)
   goals met: 0 of 10
26. (move agent_2 l3_1 l3_2)
   deleted: (at agent_2 l3_1)
   added: (at agent_2 l3_2)
   goals met: 0 of 10
27. (take_box agent_2 box_11 carrier_2 l3_2 capacity_3 capacity_4)
   deleted: (at box_11 l3_2) (carrier_capacity carrier_2 capacity_4)
   added: (box_carried_by box_11 agent_2) (carrier_capacity carrier_2 capacity_3) (on carrier_2 box_11)
   goals met: 0 of 10
28. (fill_box agent_2 box_11 supply_0 l3_2)
   deleted: (empty box_11) (at supply_0 l3_2)
   added: (contains box_11 supply_0)
   goals met: 0 of 10
29. (move agent_2 l3_2 l4_2)
   deleted: (at agent_2 l3_2)
   added: (at agent_2 l4_2)
   goals met: 0 of 10
30. (move agent_3 l4_2 l3_2)
   deleted: (at agent_3 l4_2)
   added: (at agent_3 l3_2)
   goals met: 0 of 10
31. (take_box agent_3 box_12 carrier_3 l3_2 capacity_2 capacity_3)
   deleted: (at box_12 l3_2) (carrier_capacity carrier_3 capacity_3)
   added: (box_carried_by box_12 agent_3) (carrier_capacity carrier_3 capacity_2) (on carrier_3 box_12)
   goals met: 0 of 10
32. (fill_box agent_3 box_0 supply_10 l3_2)
   deleted: (empty box_0) (at supply_10 l3_2)
   added: (contains box_0 supply_10)
   goals met: 0 of 10
33. (move agent_3 l3_2 l4_2)
   deleted: (at agent_3 l3_2)
   added: (at agent_3 l4_2)
   goals met: 0 of 10
34. (move agent_2 l4_2 l4_3)
   deleted: (at agent_2 l4_2)
   added: (at agent_2 l4_3)
   goals met: 0 of 10
35. (move agent_2 l4_3 l4_4)
   deleted: (at agent_2 l4_3)
   added: (at agent_2 l4_4)
   goals met: 0 of 10
36. (move agent_2 l4_4 l5_4)
   deleted: (at agent_2 l4_4)
   added: (at agent_2 l5_4)
   goals met: 0 of 10
37. (move agent_2 l5_4 l6_4)
   deleted: (at agent_2 l5_4)
   added: (at agent_2 l6_4)
   goals met: 0 of 10
38. (deliver_box agent_2 box_11 carrier_2 workstation_2 l6_4 capacity_3 capacity_4)
   deleted: (box_carried_by box_11 agent_2) (on carrier_2 box_11) (carrier_capacity carrier_2 capacity_3)
   added: (unloaded_box box_11 workstation_2) (carrier_capacity carrier_2 capacity_4)
   goals met: 0 of 10
39. (deliver_supply agent_2 workstation_2 valve supply_0 box_11 l6_4)
   deleted: (contains box_11 supply_0) (unloaded_box box_11 workstation_2)
   added: (loaded_to supply_0 workstation_2) (empty box_11) (at box_11 l6_4) (has workstation_2 valve)
   goals met: 1 of 10
40. (move agent_2 l6_4 l5_4)
   deleted: (at agent_2 l6_4)
   added: (at agent_2 l5_4)
   goals met: 1 of 10
41. (move agent_2 l5_4 l4_4)
   deleted: (at agent_2 l5_4)
   added: (at agent_2 l4_4)
   goals met: 1 of 10
42. (move agent_2 l4_4 l3_4)
   deleted: (at agent_2 l4_4)
   added: (at agent_2 l3_4)
   goals met: 1 of 10
43. (move agent_2 l3_4 l3_3)
   deleted: (at agent_2 l3_4)
   added: (at agent_2 l3_3)
   goals met: 1 of 10
44. (move agent_2 l3_3 l3_2)
   deleted: (at agent_2 l3_3)
   added: (at agent_2 l3_2)
   goals met: 1 of 10
45. (take_box agent_2 box_13 carrier_2 l3_2 capacity_3 capacity_4)
   deleted: (at box_13 l3_2) (carrier_capacity carrier_2 capacity_4)
   added: (box_carried_by box_13 agent_2) (carrier_capacity carrier_2 capacity_3) (on carrier_2 box_13)
   goals met: 1 of 10
46. (fill_box agent_2 box_13 supply_1 l3_2)
   deleted: (empty box_13) (at supply_1 l3_2)
   added: (contains box_13 supply_1)
   goals met: 1 of 10
47. (move agent_2 l3_2 l4_2)
   deleted: (at agent_2 l3_2)
   added: (at agent_2 l4_2)
   goals met: 1 of 10
48. (deliver_box agent_2 box_13 carrier_2 workstation_0 l4_2 capacity_3 capacity_4)
   deleted: (box_carried_by box_13 agent_2) (on carrier_2 box_13) (carrier_capacity carrier_2 capacity_3)
   added: (unloaded_box box_13 workstation_0) (carrier_capacity carrier_2 capacity_4)
   goals met: 1 of 10
49. (deliver_supply agent_3 workstation_0 valve supply_1 box_13 l4_2)
   deleted: (contains box_13 supply_1) (unloaded_box box_13 workstation_0)
   added: (loaded_to supply_1 workstation_0) (empty box_13) (at box_13 l4_2) (has workstation_0 valve)
   goals met: 2 of 10
50. (move agent_2 l4_2 l3_2)
   deleted: (at agent_2 l4_2)
   added: (at agent_2 l3_2)
   goals met: 2 of 10
51. (take_box agent_2 box_14 carrier_2 l3_2 capacity_3 capacity_4)
   deleted: (at box_14 l3_2) (carrier_capacity carrier_2 capacity_4)
   added: (box_carried_by box_14 agent_2) (carrier_capacity carrier_2 capacity_3) (on carrier_2 box_14)
   goals met: 2 of 10
52. (fill_box agent_2 box_14 supply_4 l3_2)
   deleted: (empty box_14) (at supply_4 l3_2)
   added: (contains box_14 supply_4)
   goals met: 2 of 10
53. (move agent_2 l3_2 l4_2)
   deleted: (at agent_2 l3_2)
   added: (at agent_2 l4_2)
   goals met: 2 of 10
54. (deliver_box agent_2 box_14 carrier_2 workstation_0 l4_2 capacity_3 capacity_4)
   deleted: (box_carried_by box_14 agent_2) (on carrier_2 box_14) (carrier_capacity carrier_2 capacity_3)
   added: (unloaded_box box_14 workstation_0) (carrier_capacity carrier_2 capacity_4)
   goals met: 2 of 10
55. (deliver_supply agent_3 workstation_0 bolt supply_4 box_14 l4_2)
   deleted: (contains box_14 supply_4) (unloaded_box box_14 workstation_0)
   added: (loaded_to supply_4 workstation_0) (empty box_14) (at box_14 l4_2) (has workstation_0 bolt)
   goals met: 3 of 10
56. (move agent_2 l4_2 l3_2)
   deleted: (at agent_2 l4_2)
   added: (at agent_2 l3_2)
   goals met: 3 of 10
57. (take_box agent_2 box_15 carrier_2 l3_2 capacity_3 capacity_4)
   deleted: (at box_15 l3_2) (carrier_capacity carrier_2 capacity_4)
   added: (box_carried_by box_15 agent_2) (carrier_capacity carrier_2 capacity_3) (on carrier_2 box_15)
   goals met: 3 of 10
58. (fill_box agent_2 box_15 supply_7 l3_2)
   deleted: (empty box_15) (at supply_7 l3_2)
   added: (contains box_15 supply_7)
   goals met: 3 of 10
59. (move agent_2 l3_2 l4_2)
   deleted: (at agent_2 l3_2)
   added: (at agent_2 l4_2)
   goals met: 3 of 10
60. (deliver_box agent_2 box_15 carrier_2 workstation_0 l4_2 capacity_3 capacity_4)
   deleted: (box_carried_by box_15 agent_2) (on carrier_2 box_15) (carrier_capacity carrier_2 capacity_3)
   added: (unloaded_box box_15 workstation_0) (carrier_capacity carrier_2 capacity_4)
   goals met: 3 of 10
61. (deliver_supply agent_3 workstation_0 tool supply_7 box_15 l4_2)
   deleted: (contains box_15 supply_7) (unloaded_box box_15 workstation_0)
   added: (loaded_to supply_7 workstation_0) (empty box_15) (at box_15 l4_2) (has workstation_0 tool)
   goals met: 4 of 10
62. (move agent_3 l4_2 l4_1)
   deleted: (at agent_3 l4_2)
   added: (at agent_3 l4_1)
   goals met: 4 of 10
63. (move agent_3 l4_1 l5_1)
   deleted: (at agent_3 l4_1)
   added: (at agent_3 l5_1)
   goals met: 4 of 10
64. (move agent_3 l5_1 l5_0)
   deleted: (at agent_3 l5_1)
   added: (at agent_3 l5_0)
   goals met: 4 of 10
65. (take_box agent_2 box_13 carrier_2 l4_2 capacity_3 capacity_4)
   deleted: (at box_13 l4_2) (carrier_capacity carrier_2 capacity_4)
   added: (box_carried_by box_13 agent_2) (carrier_capacity carrier_2 capacity_3) (on carrier_2 box_13)
   goals met: 4 of 10
66. (move agent_3 l5_0 l6_0)
   deleted: (at agent_3 l5_0)
   added: (at agent_3 l6_0)
   goals met: 4 of 10
67. (deliver_box agent_3 box_0 carrier_3 workstation_1 l6_0 capacity_2 capacity_3)
   deleted: (box_carried_by box_0 agent_3) (on carrier_3 box_0) (carrier_capacity carrier_3 capacity_2)
   added: (unloaded_box box_0 workstation_1) (carrier_capacity carrier_3 capacity_3)
   goals met: 4 of 10
68. (deliver_supply agent_3 workstation_1 circuit supply_10 box_0 l6_0)
   deleted: (contains box_0 supply_10) (unloaded_box box_0 workstation_1)
   added: (loaded_to supply_10 workstation_1) (empty box_0) (at box_0 l6_0) (has workstation_1 circuit)
   goals met: 5 of 10
69. (move agent_3 l6_0 l5_0)
   deleted: (at agent_3 l6_0)
   added: (at agent_3 l5_0)
   goals met: 5 of 10
70. (move agent_3 l5_0 l5_1)
   deleted: (at agent_3 l5_0)
   added: (at agent_3 l5_1)
   goals met: 5 of 10
71. (move agent_3 l5_1 l4_1)
   deleted: (at agent_3 l5_1)
   added: (at agent_3 l4_1)
   goals met: 5 of 10
72. (move agent_3 l4_1 l3_1)
   deleted: (at agent_3 l4_1)
   added: (at agent_3 l3_1)
   goals met: 5 of 10
73. (move agent_3 l3_1 l3_2)
   deleted: (at agent_3 l3_1)
   added: (at agent_3 l3_2)
   goals met: 5 of 10
74. (fill_box agent_3 box_12 supply_11 l3_2)
   deleted: (empty box_12) (at supply_11 l3_2)
   added: (contains box_12 supply_11)
   goals met: 5 of 10
75. (move agent_3 l3_2 l4_2)
   deleted: (at agent_3 l3_2)
   added: (at agent_3 l4_2)
   goals met: 5 of 10
76. (deliver_box agent_3 box_12 carrier_3 workstation_0 l4_2 capacity_3 capacity_4)
   deleted: (box_carried_by box_12 agent_3) (on carrier_3 box_12) (carrier_capacity carrier_3 capacity_3)
   added: (unloaded_box box_12 workstation_0) (carrier_capacity carrier_3 capacity_4)
   goals met: 5 of 10
77. (deliver_supply agent_3 workstation_0 circuit supply_11 box_12 l4_2)
   deleted: (contains box_12 supply_11) (unloaded_box box_12 workstation_0)
   added: (loaded_to supply_11 workstation_0) (empty box_12) (at box_12 l4_2) (has workstation_0 circuit)
   goals met: 6 of 10
78. (move agent_2 l4_2 l3_2)
   deleted: (at agent_2 l4_2)
   added: (at agent_2 l3_2)
   goals met: 6 of 10
79. (fill_box agent_2 box_13 supply_5 l3_2)
   deleted: (empty box_13) (at supply_5 l3_2)
   added: (contains box_13 supply_5)
   goals met: 6 of 10
80. (move agent_2 l3_2 l3_1)
   deleted: (at agent_2 l3_2)
   added: (at agent_2 l3_1)
   goals met: 6 of 10
81. (move agent_2 l3_1 l4_1)
   deleted: (at agent_2 l3_1)
   added: (at agent_2 l4_1)
   goals met: 6 of 10
82. (move agent_2 l4_1 l5_1)
   deleted: (at agent_2 l4_1)
   added: (at agent_2 l5_1)
   goals met: 6 of 10
83. (move agent_2 l5_1 l5_0)
   deleted: (at agent_2 l5_1)
   added: (at agent_2 l5_0)
   goals met: 6 of 10
84. (move agent_2 l5_0 l6_0)
   deleted: (at agent_2 l5_0)
   added: (at agent_2 l6_0)
   goals met: 6 of 10
85. (deliver_box agent_2 box_13 carrier_2 workstation_1 l6_0 capacity_3 capacity_4)
   deleted: (box_carried_by box_13 agent_2) (on carrier_2 box_13) (carrier_capacity carrier_2 capacity_3)
   added: (unloaded_box box_13 workstation_1) (carrier_capacity carrier_2 capacity_4)
   goals met: 6 of 10
86. (deliver_supply agent_2 workstation_1 bolt supply_5 box_13 l6_0)
   deleted: (contains box_13 supply_5) (unloaded_box box_13 workstation_1)
   added: (loaded_to supply_5 workstation_1) (empty box_13) (at box_13 l6_0) (has workstation_1 bolt)
   goals met: 7 of 10
87. (deliver_box agent_1 box_1 carrier_1 workstation_2 l6_4 capacity_3 capacity_4)
   deleted: (box_carried_by box_1 agent_1) (on carrier_1 box_1) (carrier_capacity carrier_1 capacity_3)
   added: (unloaded_box box_1 workstation_2) (carrier_capacity carrier_1 capacity_4)
   goals met: 7 of 10
88. (deliver_supply agent_1 workstation_2 bolt supply_3 box_1 l6_4)
   deleted: (contains box_1 supply_3) (unloaded_box box_1 workstation_2)
   added: (loaded_to supply_3 workstation_2) (empty box_1) (at box_1 l6_4) (has workstation_2 bolt)
   goals met: 8 of 10
89. (move agent_3 l4_2 l3_2)
   deleted: (at agent_3 l4_2)
   added: (at agent_3 l3_2)
   goals met: 8 of 10
90. (take_box agent_3 box_2 carrier_3 l3_2 capacity_3 capacity_4)
   deleted: (at box_2 l3_2) (carrier_capacity carrier_3 capacity_4)
   added: (box_carried_by box_2 agent_3) (carrier_capacity carrier_3 capacity_3) (on carrier_3 box_2)
   goals met: 8 of 10
91. (fill_box agent_3 box_2 supply_8 l3_2)
   deleted: (empty box_2) (at supply_8 l3_2)
   added: (contains box_2 supply_8)
   goals met: 8 of 10
92. (move agent_3 l3_2 l3_3)
   deleted: (at agent_3 l3_2)
   added: (at agent_3 l3_3)
   goals met: 8 of 10
93. (move agent_3 l3_3 l3_4)
   deleted: (at agent_3 l3_3)
   added: (at agent_3 l3_4)
   goals met: 8 of 10
94. (move agent_3 l3_4 l4_4)
   deleted: (at agent_3 l3_4)
   added: (at agent_3 l4_4)
   goals met: 8 of 10
95. (move agent_3 l4_4 l5_4)
   deleted: (at agent_3 l4_4)
   added: (at agent_3 l5_4)
   goals met: 8 of 10
96. (move agent_3 l5_4 l6_4)
   deleted: (at agent_3 l5_4)
   added: (at agent_3 l6_4)
   goals met: 8 of 10
97. (deliver_box agent_3 box_2 carrier_3 workstation_2 l6_4 capacity_3 capacity_4)
   deleted: (box_carried_by box_2 agent_3) (on carrier_3 box_2) (carrier_capacity carrier_3 capacity_3)
   added: (unloaded_box box_2 workstation_2) (carrier_capacity carrier_3 capacity_4)
   goals met: 8 of 10
98. (deliver_supply agent_3 workstation_2 tool supply_8 box_2 l6_4)
   deleted: (contains box_2 supply_8) (unloaded_box box_2 workstation_2)
   added: (loaded_to supply_8 workstation_2) (empty box_2) (at box_2 l6_4) (has workstation_2 tool)
   goals met: 9 of 10
99. (deliver_box agent_0 box_10 carrier_0 workstation_1 l6_0 capacity_3 capacity_4)
   deleted: (box_carried_by box_10 agent_0) (on carrier_0 box_10) (carrier_capacity carrier_0 capacity_3)
   added: (unloaded_box box_10 workstation_1) (carrier_capacity carrier_0 capacity_4)
   goals met: 9 of 10
100. (deliver_supply agent_2 workstation_1 tool supply_6 box_10 l6_0)
   deleted: (contains box_10 supply_6) (unloaded_box box_10 workstation_1)
   added: (loaded_to supply_6 workstation_1) (empty box_10) (at box_10 l6_0) (has workstation_1 tool)
   goals met: 10 of 10
